tasmota/arduino-esp32/libraries/WiFi/src/STA.cpp
/*
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#include "WiFi.h"
#include "WiFiGeneric.h"
#include "WiFiSTA.h"
#if SOC_WIFI_SUPPORTED
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <inttypes.h>
#include <string.h>
#include <esp_err.h>
#include <esp_wifi.h>
#include <esp_event.h>
#include <esp32-hal.h>
#include <lwip/ip_addr.h>
#include "lwip/err.h"
#include "lwip/dns.h"
#include <esp_smartconfig.h>
#include <esp_netif.h>
#include "esp_mac.h"

#if __has_include("esp_eap_client.h")
#include "esp_eap_client.h"
#else
#include "esp_wpa2.h"
#endif

esp_netif_t *get_esp_interface_netif(esp_interface_t interface);

static size_t _wifi_strncpy(char *dst, const char *src, size_t dst_len) {
  if (!dst || !src || !dst_len) {
    return 0;
  }
  size_t src_len = strlen(src);
  if (src_len >= dst_len) {
    src_len = dst_len;
  } else {
    src_len += 1;
  }
  memcpy(dst, src, src_len);
  return src_len;
}

static STAClass *_sta_network_if = NULL;

static esp_event_handler_instance_t _sta_ev_instance = NULL;
static void _sta_event_cb(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data) {
  if (event_base == WIFI_EVENT) {
    ((STAClass *)arg)->_onStaEvent(event_id, event_data);
  }
}

static bool _is_staReconnectableReason(uint8_t reason) {
  switch (reason) {
    case WIFI_REASON_UNSPECIFIED:
    //Timeouts (retry)
    case WIFI_REASON_AUTH_EXPIRE:
    case WIFI_REASON_4WAY_HANDSHAKE_TIMEOUT:
    case WIFI_REASON_GROUP_KEY_UPDATE_TIMEOUT:
    case WIFI_REASON_802_1X_AUTH_FAILED:
    case WIFI_REASON_HANDSHAKE_TIMEOUT:
    //Transient error (reconnect)
    case WIFI_REASON_AUTH_LEAVE:
    case WIFI_REASON_ASSOC_EXPIRE:
    case WIFI_REASON_ASSOC_TOOMANY:
    case WIFI_REASON_NOT_AUTHED:
    case WIFI_REASON_NOT_ASSOCED:
    case WIFI_REASON_ASSOC_NOT_AUTHED:
    case WIFI_REASON_MIC_FAILURE:
    case WIFI_REASON_IE_IN_4WAY_DIFFERS:
    case WIFI_REASON_INVALID_PMKID:
    case WIFI_REASON_BEACON_TIMEOUT:
    case WIFI_REASON_NO_AP_FOUND:
    case WIFI_REASON_ASSOC_FAIL:
    case WIFI_REASON_CONNECTION_FAIL:
    case WIFI_REASON_AP_TSF_RESET:
    case WIFI_REASON_ROAMING:            return true;
    default:                             return false;
  }
}

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_VERBOSE
static const char *auth_mode_str(int authmode) {
  switch (authmode) {
    case WIFI_AUTH_OPEN:            return ("OPEN"); break;
    case WIFI_AUTH_WEP:             return ("WEP"); break;
    case WIFI_AUTH_WPA_PSK:         return ("WPA_PSK"); break;
    case WIFI_AUTH_WPA2_PSK:        return ("WPA2_PSK"); break;
    case WIFI_AUTH_WPA_WPA2_PSK:    return ("WPA_WPA2_PSK"); break;
    case WIFI_AUTH_WPA2_ENTERPRISE: return ("WPA2_ENTERPRISE"); break;
    case WIFI_AUTH_WPA3_PSK:        return ("WPA3_PSK"); break;
    case WIFI_AUTH_WPA2_WPA3_PSK:   return ("WPA2_WPA3_PSK"); break;
    case WIFI_AUTH_WAPI_PSK:        return ("WPAPI_PSK"); break;
    default:                        break;
  }
  return ("UNKNOWN");
}
#endif

static void _onStaArduinoEvent(arduino_event_t *ev) {
  if (_sta_network_if == NULL || ev->event_id < ARDUINO_EVENT_WIFI_STA_START || ev->event_id > ARDUINO_EVENT_WIFI_STA_LOST_IP) {
    return;
  }
  static bool first_connect = true;
  log_d("Arduino STA Event: %d - %s", ev->event_id, Network.eventName(ev->event_id));

  if (ev->event_id == ARDUINO_EVENT_WIFI_STA_START) {
    _sta_network_if->_setStatus(WL_DISCONNECTED);
    if (esp_wifi_set_ps(WiFi.getSleep()) != ESP_OK) {
      log_e("esp_wifi_set_ps failed");
    }
  } else if (ev->event_id == ARDUINO_EVENT_WIFI_STA_STOP) {
    _sta_network_if->_setStatus(WL_STOPPED);
  } else if (ev->event_id == ARDUINO_EVENT_WIFI_STA_CONNECTED) {
    _sta_network_if->_setStatus(WL_IDLE_STATUS);
    if (_sta_network_if->getStatusBits() & ESP_NETIF_WANT_IP6_BIT) {
      esp_err_t err = esp_netif_create_ip6_linklocal(_sta_network_if->netif());
      if (err != ESP_OK) {
        log_e("Failed to enable IPv6 Link Local on STA:  0x%x: %s", err, esp_err_to_name(err));
      } else {
        log_v("Enabled IPv6 Link Local on %s", _sta_network_if->desc());
      }
    }
  } else if (ev->event_id == ARDUINO_EVENT_WIFI_STA_DISCONNECTED) {
    uint8_t reason = ev->event_info.wifi_sta_disconnected.reason;
    // Reason 0 causes crash, use reason 1 (UNSPECIFIED) instead
    if (!reason) {
      reason = WIFI_REASON_UNSPECIFIED;
    }
    log_w("Reason: %u - %s", reason, WiFi.STA.disconnectReasonName((wifi_err_reason_t)reason));
    if (reason == WIFI_REASON_NO_AP_FOUND) {
      _sta_network_if->_setStatus(WL_NO_SSID_AVAIL);
    } else if ((reason == WIFI_REASON_AUTH_FAIL) && !first_connect) {
      _sta_network_if->_setStatus(WL_CONNECT_FAILED);
    } else if (reason == WIFI_REASON_BEACON_TIMEOUT || reason == WIFI_REASON_HANDSHAKE_TIMEOUT) {
      _sta_network_if->_setStatus(WL_CONNECTION_LOST);
    } else if (reason == WIFI_REASON_AUTH_EXPIRE) {

    } else {
      _sta_network_if->_setStatus(WL_DISCONNECTED);
    }

    bool DoReconnect = false;
    if (reason == WIFI_REASON_ASSOC_LEAVE) {  //Voluntarily disconnected. Don't reconnect!
    } else if (first_connect) {               //Retry once for all failure reasons
      first_connect = false;
      DoReconnect = true;
      log_d("WiFi Reconnect Running");
    } else if (_sta_network_if->getAutoReconnect() && _is_staReconnectableReason(reason)) {
      DoReconnect = true;
      log_d("WiFi AutoReconnect Running");
    } else if (reason == WIFI_REASON_ASSOC_FAIL) {
      _sta_network_if->_setStatus(WL_CONNECT_FAILED);
    }
    if (DoReconnect) {
      _sta_network_if->disconnect();
      _sta_network_if->connect();
    }
  } else if (ev->event_id == ARDUINO_EVENT_WIFI_STA_GOT_IP) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG
    uint8_t *ip = (uint8_t *)&(ev->event_info.got_ip.ip_info.ip.addr);
    uint8_t *mask = (uint8_t *)&(ev->event_info.got_ip.ip_info.netmask.addr);
    uint8_t *gw = (uint8_t *)&(ev->event_info.got_ip.ip_info.gw.addr);
    log_d(
      "STA IP: %u.%u.%u.%u, MASK: %u.%u.%u.%u, GW: %u.%u.%u.%u", ip[0], ip[1], ip[2], ip[3], mask[0], mask[1], mask[2], mask[3], gw[0], gw[1], gw[2], gw[3]
    );
#endif
    _sta_network_if->_setStatus(WL_CONNECTED);
  } else if (ev->event_id == ARDUINO_EVENT_WIFI_STA_LOST_IP) {
    _sta_network_if->_setStatus(WL_IDLE_STATUS);
  }
}

void STAClass::_onStaEvent(int32_t event_id, void *event_data) {
  arduino_event_t arduino_event;
  arduino_event.event_id = ARDUINO_EVENT_MAX;

  if (event_id == WIFI_EVENT_STA_START) {
    log_v("STA Started");
    arduino_event.event_id = ARDUINO_EVENT_WIFI_STA_START;
    setStatusBits(ESP_NETIF_STARTED_BIT);
  } else if (event_id == WIFI_EVENT_STA_STOP) {
    log_v("STA Stopped");
    arduino_event.event_id = ARDUINO_EVENT_WIFI_STA_STOP;
    clearStatusBits(
      ESP_NETIF_STARTED_BIT | ESP_NETIF_CONNECTED_BIT | ESP_NETIF_HAS_IP_BIT | ESP_NETIF_HAS_LOCAL_IP6_BIT | ESP_NETIF_HAS_GLOBAL_IP6_BIT
      | ESP_NETIF_HAS_STATIC_IP_BIT
    );
  } else if (event_id == WIFI_EVENT_STA_AUTHMODE_CHANGE) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_VERBOSE
    wifi_event_sta_authmode_change_t *event = (wifi_event_sta_authmode_change_t *)event_data;
    log_v("STA Auth Mode Changed: From: %s, To: %s", auth_mode_str(event->old_mode), auth_mode_str(event->new_mode));
#endif
    arduino_event.event_id = ARDUINO_EVENT_WIFI_STA_AUTHMODE_CHANGE;
    memcpy(&arduino_event.event_info.wifi_sta_authmode_change, event_data, sizeof(wifi_event_sta_authmode_change_t));
  } else if (event_id == WIFI_EVENT_STA_CONNECTED) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_VERBOSE
    wifi_event_sta_connected_t *event = (wifi_event_sta_connected_t *)event_data;
    log_v(
      "STA Connected: SSID: %s, BSSID: " MACSTR ", Channel: %u, Auth: %s", event->ssid, MAC2STR(event->bssid), event->channel, auth_mode_str(event->authmode)
    );
#endif
    arduino_event.event_id = ARDUINO_EVENT_WIFI_STA_CONNECTED;
    memcpy(&arduino_event.event_info.wifi_sta_connected, event_data, sizeof(wifi_event_sta_connected_t));
    setStatusBits(ESP_NETIF_CONNECTED_BIT);
  } else if (event_id == WIFI_EVENT_STA_DISCONNECTED) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_VERBOSE
    wifi_event_sta_disconnected_t *event = (wifi_event_sta_disconnected_t *)event_data;
    log_v("STA Disconnected: SSID: %s, BSSID: " MACSTR ", Reason: %u", event->ssid, MAC2STR(event->bssid), event->reason);
#endif
    arduino_event.event_id = ARDUINO_EVENT_WIFI_STA_DISCONNECTED;
    memcpy(&arduino_event.event_info.wifi_sta_disconnected, event_data, sizeof(wifi_event_sta_disconnected_t));
    clearStatusBits(ESP_NETIF_CONNECTED_BIT | ESP_NETIF_HAS_IP_BIT | ESP_NETIF_HAS_LOCAL_IP6_BIT | ESP_NETIF_HAS_GLOBAL_IP6_BIT);
  } else {
    return;
  }

  if (arduino_event.event_id < ARDUINO_EVENT_MAX) {
    Network.postEvent(&arduino_event);
  }
}

STAClass::STAClass()
  : _minSecurity(WIFI_AUTH_WPA2_PSK), _scanMethod(WIFI_FAST_SCAN), _sortMethod(WIFI_CONNECT_AP_BY_SIGNAL), _autoReconnect(true), _status(WL_STOPPED) {
  _sta_network_if = this;
}

STAClass::~STAClass() {
  end();
  _sta_network_if = NULL;
}

wl_status_t STAClass::status() {
  return _status;
}

void STAClass::_setStatus(wl_status_t status) {
  _status = status;
}

/**
 * Sets the working bandwidth of the STA mode
 * @param m wifi_bandwidth_t
 */
bool STAClass::bandwidth(wifi_bandwidth_t bandwidth) {
  if (!begin()) {
    return false;
  }

  esp_err_t err;
  err = esp_wifi_set_bandwidth(WIFI_IF_STA, bandwidth);
  if (err) {
    log_e("Could not set STA bandwidth! 0x%x: %s", err, esp_err_to_name(err));
    return false;
  }

